package HTTP

import (
	"fmt"
	"net"
)

func Run() {
	fmt.Printf("%x", 4)
	addr, _ := net.ResolveTCPAddr("tcp", ":1080")
	srv, err := net.ListenTCP("tcp", addr)
	fmt.Println(err)
	for {
		conn, err := srv.Accept()
		fmt.Println(err)
		go func() {
			conn.Write([]byte("HTTP/1.1 200 OK\r\n"))
			conn.Write([]byte("Date: Wed, 18 Dec 2019 07:52:18 GMT\r\n"))
			conn.Write([]byte("Content-Type: text/plain; charset=utf-8\r\n"))
			conn.Write([]byte("Transfer-Encoding: chunked\r\n"))
			_, err = fmt.Fprintf(conn, "\r\n")

			_, err = fmt.Fprintf(conn, "%x\r\n", 0x04)
			_, err = fmt.Fprintf(conn, "%v\r\n", "1234")

			_, err = fmt.Fprintf(conn, "%x\r\n", len(str))
			_, err = fmt.Fprintf(conn, "%v\r\n", str)

			_, err = fmt.Fprintf(conn, "%x\r\n", 0)
			_, err = fmt.Fprintf(conn, "\r\n")

		}()
	}
}

var str = `
订单编号,订单名称,付款金额,订单状态,发票类型,下单日期,失效日期
213010081799733248,大象云渲染服务精英版标准套餐,13020,0,0,2019-12-16 18:11:34,
213006500044472320,大象云渲染服务精英版标准套餐,13020,0,0,2019-12-16 17:57:20,
213004331044044800,大象云渲染服务精英版标准套餐,13020,0,0,2019-12-16 17:48:43,
213002804329971712,大象云渲染服务精英版标准套餐,13020,0,0,2019-12-16 17:42:39,
213002393900548096,大象云渲染服务精英版标准套餐,13020,0,0,2019-12-16 17:41:01,
212994020190715904,大象云渲染服务精英版标准套餐,13020,0,0,2019-12-16 17:07:45,
212993909356232704,大象云渲染服务精英版标准套餐,13020,0,0,2019-12-16 17:07:18,
212993522029035520,大象云渲染服务精英版标准套餐,13020,0,0,2019-12-16 17:05:46,
212991293926670336,大象云渲染服务精英版标准套餐,13020,0,0,2019-12-16 16:56:55,
212991216218800128,,0,0,0,2019-12-16 16:56:36,
212987874109292544,大象云渲染服务精英版标准套餐,13020,0,0,2019-12-16 16:43:19,
212987788730040320,大象云渲染服务精英版标准套餐,13020,0,0,2019-12-16 16:42:59,
212985868510560256,大象云渲染服务精英版标准套餐,13020,0,0,2019-12-16 16:35:21,
212925673809903616,大象云渲染服务精英版标准套餐,13020,0,0,2019-12-16 12:36:10,
212925489755455488,大象云渲染服务精英版标准套餐,13020,0,0,2019-12-16 12:35:26,
212925455680929792,大象云渲染服务精英版标准套餐,13020,0,0,2019-12-16 12:35:18,
212925428338262016,大象云渲染服务精英版标准套餐,13020,0,0,2019-12-16 12:35:11,
212923269764874240,大象云渲染服务精英版标准套餐,13020,0,0,2019-12-16 12:26:36,
212923161916735488,大象云渲染服务精英版标准套餐,13020,0,0,2019-12-16 12:26:11,
212923124218331136,大象云渲染服务精英版标准套餐,13020,0,0,2019-12-16 12:26:02,
212923016768651264,大象云渲染服务精英版标准套餐,13020,0,0,2019-12-16 12:25:38,
211540265435922432,精英版标准套餐,13020,
`
